// CREENCIAS ACTIVADORAS POR FLOR DE BACH
// Informaci칩n Adaptativa para Reprogramaci칩n de Campo M칩rfico

const activatingBeliefs = {
    // GRUPO 1: PARA EL MIEDO
    "Rock Rose": [
        "Mi cuerpo sabe c칩mo mantenerse estable y centrado durante situaciones intensas.",
        "Tengo acceso natural a la calma que necesito en cualquier momento desafiante.",
        "Mi organismo regresa autom치ticamente al equilibrio despu칠s de cualquier activaci칩n."
    ],
    "Mimulus": [
        "Tengo la capacidad natural de distinguir entre peligro real y percibido.",
        "Mi instinto me gu칤a hacia situaciones seguras y personas confiables.",
        "Existe un orden natural que sostiene mi seguridad y bienestar."
    ],
    "Cherry Plum": [
        "Mi mente tiene mecanismos naturales de autorregulaci칩n que funcionan perfectamente.",
        "Poseo un centro interno de estabilidad que no puede ser perturbado.",
        "Mi consciencia mantiene el control apropiado en todas las circunstancias."
    ],
    "Aspen": [
        "Mi intuici칩n diferencia claramente entre presentimientos reales y ansiedad infundada.",
        "Estoy naturalmente protegido por mi propia sabidur칤a interna.",
        "Mi ser reconoce las verdaderas se침ales de alerta y ignora las falsas alarmas."
    ],
    "Red Chestnut": [
        "Cada persona tiene su propia protecci칩n natural y sabidur칤a para navegar su vida.",
        "Mi amor hacia otros incluye confiar en su capacidad de cuidarse a s칤 mismos.",
        "Puedo amar profundamente sin asumir responsabilidad por el destino de otros."
    ],

    // GRUPO 2: PARA LA INCERTIDUMBRE Y LA DUDA
    "Cerato": [
        "Mi sabidur칤a interna contiene toda la informaci칩n que necesito para decidir correctamente.",
        "Poseo un sistema de navegaci칩n interior m치s confiable que cualquier consejo externo.",
        "Mis decisiones emergen naturalmente cuando me conecto con mi conocimiento interno."
    ],
    "Scleranthus": [
        "Mi mente tiene la capacidad natural de encontrar claridad en medio de opciones m칰ltiples.",
        "Existe una elecci칩n 칩ptima que se revela cuando dejo de forzar la decisi칩n.",
        "Mi ser conoce el camino correcto y me lo muestra a trav칠s de se침ales internas claras."
    ],
    "Gentian": [
        "Cada obst치culo contiene informaci칩n valiosa que me redirige hacia mejores soluciones.",
        "Mi resistencia natural se fortalece cada vez que supero una dificultad.",
        "Los contratiempos son ajustes necesarios que me alinean con mi verdadero prop칩sito."
    ],
    "Gorse": [
        "Siempre existen posibilidades que mi mente limitada a칰n no ha considerado.",
        "Mi capacidad de renovaci칩n es mayor que cualquier crisis que pueda enfrentar.",
        "La vida tiene recursos infinitos para crear soluciones desde donde menos las espero."
    ],
    "Hornbeam": [
        "Mi energ칤a vital se renueva autom치ticamente cuando me alineo con actividades aut칠nticas.",
        "Poseo reservas naturales de vitalidad que se activan cuando las necesito.",
        "Mi entusiasmo regresa naturalmente cuando reconecto con lo que verdaderamente importa."
    ],
    "Wild Oat": [
        "Mi prop칩sito de vida se revela gradualmente a trav칠s de mis experiencias y preferencias.",
        "Tengo una vocaci칩n 칰nica que emerge cuando conf칤o en mi proceso natural de descubrimiento.",
        "Cada experiencia me acerca m치s a reconocer mi contribuci칩n espec칤fica al mundo."
    ],

    // GRUPO 3: PARA LA FALTA DE INTER칄S EN EL PRESENTE
    "Clematis": [
        "El momento presente contiene todas las semillas de los futuros que deseo crear.",
        "Mi creatividad encuentra expresi칩n pr치ctica y tangible en la realidad actual.",
        "Puedo so침ar y planificar mientras permanezco completamente comprometido con el ahora."
    ],
    "Honeysuckle": [
        "Mi pasado me ha preparado perfectamente para aprovechar las oportunidades presentes.",
        "Cada momento actual contiene la posibilidad de crear experiencias tan valiosas como las pasadas.",
        "Honro mi historia mientras abrazo completamente lo que est치 emergiendo ahora."
    ],
    "Wild Rose": [
        "Mi inter칠s natural por la vida se reactiva cuando reconozco mi poder para influir en mi experiencia.",
        "Poseo una chispa interna que se enciende cuando me permito participar activamente en mi vida.",
        "Cada d칤a ofrece peque침as oportunidades para redescubrir mi pasi칩n por existir."
    ],
    "Olive": [
        "Mi vitalidad se restaura naturalmente cuando respeto mis ritmos de actividad y descanso.",
        "Tengo acceso a fuentes profundas de energ칤a que se renuevan con el cuidado apropiado.",
        "Mi cuerpo y mente saben c칩mo regenerarse completamente cuando les doy lo que necesitan."
    ],
    "White Chestnut": [
        "Mi mente tiene la capacidad natural de encontrar quietud y claridad cuando la permito.",
        "Poseo un centro de calma mental que permanece intacto bajo cualquier circunstancia.",
        "Mis pensamientos se organizan autom치ticamente hacia patrones constructivos y 칰tiles."
    ],
    "Mustard": [
        "Mi estado emocional natural es de equilibrio y bienestar estable.",
        "Poseo una luz interna que no puede ser apagada por circunstancias temporales.",
        "Mi alegr칤a es independiente de eventos externos y surge de mi propia naturaleza."
    ],
    "Chestnut Bud": [
        "Cada experiencia me ense침a algo valioso que integro autom치ticamente en mi sabidur칤a.",
        "Poseo la capacidad natural de reconocer patrones y extraer lecciones 칰tiles.",
        "Mi aprendizaje se acelera cuando observo conscientemente los resultados de mis acciones."
    ],

    // GRUPO 4: PARA LA SOLEDAD
    "Water Violet": [
        "Puedo mantener mi individualidad 칰nica mientras me conecto genuinamente con otros.",
        "Mi sabidur칤a se comparte naturalmente de maneras que nutren sin abrumar.",
        "Equilibro perfectamente mi necesidad de soledad con mi deseo de contribuir."
    ],
    "Impatiens": [
        "Mi ritmo natural se ajusta autom치ticamente para sincronizarse armoniosamente con otros.",
        "Poseo la paciencia inherente para permitir que cada proceso se desarrolle en su tiempo 칩ptimo.",
        "Mi eficiencia incluye naturalmente la consideraci칩n por los ritmos diferentes de las personas."
    ],
    "Heather": [
        "Mi necesidad de atenci칩n se satisface cuando me convierto en una fuente de inter칠s genuino por otros.",
        "Poseo historias y experiencias valiosas que comparto de maneras que enriquecen las conversaciones.",
        "Mi presencia se vuelve magn칠tica cuando me enfoco en contribuir en lugar de recibir."
    ],

    // GRUPO 5: PARA LA HIPERSENSIBILIDAD
    "Agrimony": [
        "Mi bienestar genuino se expresa naturalmente sin necesidad de m치scaras o actuaciones.",
        "Tengo la fortaleza interna para mostrar mis sentimientos aut칠nticos con serenidad.",
        "Mi paz interior es tan real que no requiere ser escondida o protegida artificialmente."
    ],
    "Centaury": [
        "Mi servicio hacia otros emerge naturalmente de mi fortaleza, no de mi debilidad.",
        "Poseo l칤mites internos claros que me permiten ayudar sin sacrificar mi bienestar.",
        "Mi generosidad es m치s poderosa cuando surge de mi plenitud personal."
    ],
    "Walnut": [
        "Mi ser mantiene su propia frecuencia estable independientemente del entorno.",
        "Solo incorporo las influencias que nutren mi bienestar y crecimiento.",
        "Mi naturaleza esencial permanece intacta mientras me adapto a los cambios."
    ],
    "Holly": [
        "El 칠xito y la felicidad de otros son evidencia de que estas experiencias est치n disponibles para m칤 tambi칠n.",
        "Mi coraz칩n tiene la capacidad natural de expandirse para incluir el bienestar de todos.",
        "Cada acto de amor que doy regresa a m칤 multiplicado de formas inesperadas."
    ],

    // GRUPO 6: PARA EL ABATIMIENTO Y LA DESESPERACI칍N
    "Larch": [
        "Poseo capacidades inherentes que se expresan naturalmente cuando son necesarias.",
        "Mi verdadera naturaleza incluye talentos 칰nicos que benefician a mi entorno.",
        "Cada situaci칩n revela una habilidad m칤a que estaba esperando manifestarse."
    ],
    "Pine": [
        "Mis errores son parte natural del proceso de aprendizaje y crecimiento humano.",
        "Poseo la sabidur칤a interna para distinguir entre responsabilidad real y culpa innecesaria.",
        "Merezco el mismo amor y comprensi칩n que naturalmente ofrezco a otros."
    ],
    "Elm": [
        "Mi capacidad se expande naturalmente para cubrir las responsabilidades que acepto conscientemente.",
        "Poseo recursos internos que se activan autom치ticamente cuando son verdaderamente necesarios.",
        "Cada desaf칤o que acepto viene acompa침ado de las herramientas necesarias para resolverlo."
    ],
    "Sweet Chestnut": [
        "Este momento dif칤cil es el punto de transformaci칩n hacia una nueva etapa de mi vida.",
        "Poseo una fortaleza interna que no puede ser destruida por ninguna circunstancia externa.",
        "Cada crisis profunda precede a un renacimiento a칰n m치s profundo."
    ],
    "Star Of Bethlehem": [
        "Mi ser tiene la capacidad natural de integrar todas las experiencias en sabidur칤a y fortaleza.",
        "Cada trauma pasado se transforma en una fuente de compasi칩n y entendimiento.",
        "Poseo mecanismos internos de sanaci칩n que trabajan constantemente para restaurar mi integridad."
    ],
    "Willow": [
        "Tengo el poder real de influir en mi experiencia a trav칠s de mis elecciones y perspectivas.",
        "Mi vida actual es el resultado de decisiones pasadas y puedo crear un futuro diferente.",
        "Cada momento presente es una oportunidad para ejercer mi capacidad de autodeterminaci칩n."
    ],
    "Oak": [
        "Mi fortaleza verdadera incluye la sabidur칤a de reconocer cu치ndo necesito descanso y apoyo.",
        "Puedo ser fuerte y resistente mientras acepto ayuda y cuidado de otros.",
        "Mi perseverancia es m치s efectiva cuando incluye estrategias inteligentes de conservaci칩n de energ칤a."
    ],
    "Crab Apple": [
        "Mi cuerpo y mi ser son expresiones perfectas de la vida que merecen amor y aceptaci칩n.",
        "Poseo una belleza inherente que trasciende cualquier imperfecci칩n percibida.",
        "Mi valor como persona es independiente de cualquier caracter칤stica f칤sica o mental espec칤fica."
    ],

    // GRUPO 7: PARA LA PREOCUPACI칍N EXCESIVA POR OTROS
    "Chicory": [
        "Mi amor es m치s poderoso cuando permite que otros crezcan seg칰n su propia sabidur칤a.",
        "Cada persona tiene su propio camino perfecto que respeto incluso cuando no lo comprendo.",
        "Mi felicidad genuina es independiente de las elecciones que otros hacen en sus vidas."
    ],
    "Vervain": [
        "Mi entusiasmo es m치s contagioso cuando permito que otros lleguen a sus propias conclusiones.",
        "Las ideas verdaderamente valiosas se esparcen naturalmente sin necesidad de persuasi칩n forzada.",
        "Mi ejemplo personal es la forma m치s poderosa de compartir lo que he aprendido."
    ],
    "Vine": [
        "Mi liderazgo verdadero inspira a otros a descubrir su propia fuerza y autoridad.",
        "Poseo la capacidad de guiar sin controlar y de influir sin dominar.",
        "Mi poder se multiplica cuando empodero a otros en lugar de dirigirlos."
    ],
    "Beech": [
        "Cada persona est치 haciendo lo mejor que puede con los recursos y entendimiento que posee actualmente.",
        "Las diferencias entre las personas enriquecen mi experiencia y ampl칤an mi perspectiva.",
        "Mi tolerancia y comprensi칩n crean un espacio donde otros pueden evolucionar naturalmente."
    ],
    "Rock Water": [
        "Mi disciplina verdadera incluye la flexibilidad para adaptarme a circunstancias cambiantes.",
        "Puedo mantener mis principios mientras disfruto de la espontaneidad y el placer de vivir.",
        "Mi ejemplo m치s poderoso es demostrar que la evoluci칩n personal incluye alegr칤a y celebraci칩n."
    ]
};

// FUNCI칍N PARA INTEGRAR EN EL C칍DIGO PRINCIPAL
function getActivatingBeliefsForFlower(flowerName) {
    return activatingBeliefs[flowerName] || [];
}

// FUNCI칍N PARA OBTENER UNA CREENCIA ACTIVADORA ALEATORIA
function getRandomActivatingBelief(flowerName) {
    const beliefs = activatingBeliefs[flowerName];
    if (!beliefs || beliefs.length === 0) return "";
    return beliefs[Math.floor(Math.random() * beliefs.length)];
}

// FUNCI칍N PARA POBLAR SUGERENCIAS EN EL WIZARD
function populateAntidoteSuggestions(flowerName) {
    const beliefs = getActivatingBeliefsForFlower(flowerName);
    
    // Buscar o crear contenedor de sugerencias
    let container = document.getElementById('antidote-suggestions-container');
    if (!container) {
        // Crear contenedor si no existe
        container = document.createElement('div');
        container.id = 'antidote-suggestions-container';
        container.className = 'mt-2';
        
        // Insertar despu칠s del textarea de ant칤doto
        const antidoteInput = document.getElementById('antidote-input');
        if (antidoteInput && antidoteInput.parentNode) {
            antidoteInput.parentNode.insertBefore(container, antidoteInput.nextSibling);
        }
    }
    
    if (beliefs.length > 0) {
        container.innerHTML = '<h4 class="text-sm font-medium text-indigo-300 mb-2">游눠 Sugerencias de Activaci칩n:</h4>';
        beliefs.forEach((belief, index) => {
            const item = document.createElement('div');
            item.className = 'text-sm text-gray-300 p-2 border border-gray-600 rounded cursor-pointer hover:bg-indigo-900/30 mb-1';
            item.innerHTML = `<span class="text-xs text-gray-500">${index + 1}.</span> ${belief}`;
            item.onclick = () => {
                document.getElementById('antidote-input').value = belief;
                // Opcional: a침adir efecto visual de selecci칩n
                container.querySelectorAll('div').forEach(div => div.classList.remove('bg-indigo-900/50'));
                item.classList.add('bg-indigo-900/50');
            };
            container.appendChild(item);
        });
    } else {
        container.innerHTML = '<p class="text-sm text-gray-500">No hay sugerencias disponibles para esta flor.</p>';
    }
}

// FUNCI칍N PARA INTEGRAR EN selectBachFlower()
function enhanceFlowerSelection(flower) {
    // Llamar despu칠s de seleccionar la flor
    populateAntidoteSuggestions(flower.name);
    
    // Opcional: pre-llenar con una sugerencia aleatoria
    const randomBelief = getRandomActivatingBelief(flower.name);
    if (randomBelief) {
        const antidoteInput = document.getElementById('antidote-input');
        if (antidoteInput && !antidoteInput.value.trim()) {
            antidoteInput.placeholder = `Sugerencia: ${randomBelief}`;
        }
    }
}